{"parametrized_description": "A dentist must determine the number of molars and canines to fill, ensuring that ResinPerMolar multiplied by the number of molars plus ResinPerCanine multiplied by the number of canines does not exceed TotalResin. Additionally, the number of canines must be at least MinPercentageCanines times the total number of cavities filled, and the number of molars must be at least MinNumMolars. The objective is to minimize the total pain killer used, which is PainKillerPerMolar multiplied by the number of molars plus PainKillerPerCanine multiplied by the number of canines.", "keywords": ["N.A."], "parameters": {"TotalResin": {"description": "Total amount of resin available for filling cavities", "shape": []}, "ResinPerMolar": {"description": "Units of resin required to fill one molar", "shape": []}, "ResinPerCanine": {"description": "Units of resin required to fill one canine", "shape": []}, "PainKillerPerMolar": {"description": "Units of pain killer required to fill one molar", "shape": []}, "PainKillerPerCanine": {"description": "Units of pain killer required to fill one canine", "shape": []}, "MinPercentageCanines": {"description": "Minimum fraction of cavities filled that must be canines", "shape": []}, "MinNumMolars": {"description": "Minimum number of molars that must be filled", "shape": []}}, "variables": {"NumberMolars": {"description": "The number of molars to be filled", "type": "continuous", "shape": []}, "NumberCanines": {"description": "The number of canines to be filled", "type": "continuous", "shape": []}}, "constraints": [{"description": "The total resin used for filling molars and canines must not exceed the total available resin. This is represented by ResinPerMolar multiplied by the number of molars plus ResinPerCanine multiplied by the number of canines being less than or equal to TotalResin.", "formulation": "ResinPerMolar \\times NumberMolars + ResinPerCanine \\times NumberCanines \\leq TotalResin", "code": {"gurobipy": "model.addConstr(ResinPerMolar * NumberMolars + ResinPerCanine * NumberCanines <= TotalResin)"}}, {"description": "The number of canines filled must be at least MinPercentageCanines times the total number of cavities filled. This means that the number of canines is at least MinPercentageCanines multiplied by the sum of the number of molars and canines.", "formulation": "NumberCanines \\geq MinPercentageCanines \\times (NumberCanines + NumberMolars)", "code": {"gurobipy": "model.addConstr(NumberCanines >= MinPercentageCanines * (NumberCanines + NumberMolars))"}}, {"description": "The number of molars filled must be at least MinNumMolars.", "formulation": "NumberMolars \\geq MinNumMolars", "code": {"gurobipy": "model.addConstr(NumberMolars >= MinNumMolars)"}}], "objective": {"description": "Minimize the total pain killer used, which is PainKillerPerMolar multiplied by the number of molars plus PainKillerPerCanine multiplied by the number of canines.", "formulation": "Min \\ PainKillerPerMolar \\times NumberMolars + PainKillerPerCanine \\times NumberCanines", "code": {"gurobipy": "model.setObjective(PainKillerPerMolar * NumberMolars + PainKillerPerCanine * NumberCanines, GRB.MINIMIZE)"}}}