{"parametrized_description": "A grilled cheese shop sells Light and Heavy grilled cheese sandwiches. A Light grilled cheese sandwich requires BreadPerLight slices of bread and CheesePerLight slices of cheese. A Heavy grilled cheese sandwich requires BreadPerHeavy slices of bread and CheesePerHeavy slices of cheese. The store must make at least MinHeavyToLightRatio times as many Heavy grilled cheese sandwiches as Light grilled cheese sandwiches. The store has TotalBread slices of bread and TotalCheese slices of cheese available. A Light grilled cheese sandwich takes TimePerLight minutes to make and a Heavy grilled cheese sandwich takes TimePerHeavy minutes to make. The objective is to minimize the total production time.", "keywords": ["N.A."], "parameters": {"BreadPerLight": {"description": "Number of slices of bread required to make one light grilled cheese sandwich", "shape": []}, "CheesePerLight": {"description": "Number of slices of cheese required to make one light grilled cheese sandwich", "shape": []}, "BreadPerHeavy": {"description": "Number of slices of bread required to make one heavy grilled cheese sandwich", "shape": []}, "CheesePerHeavy": {"description": "Number of slices of cheese required to make one heavy grilled cheese sandwich", "shape": []}, "MinHeavyToLightRatio": {"description": "Minimum ratio of heavy grilled cheese sandwiches to light grilled cheese sandwiches", "shape": []}, "TotalBread": {"description": "Total number of slices of bread available", "shape": []}, "TotalCheese": {"description": "Total number of slices of cheese available", "shape": []}, "TimePerLight": {"description": "Time in minutes to make one light grilled cheese sandwich", "shape": []}, "TimePerHeavy": {"description": "Time in minutes to make one heavy grilled cheese sandwich", "shape": []}}, "variables": {"LightSandwiches": {"description": "The number of light grilled cheese sandwiches produced", "type": "continuous", "shape": []}, "HeavySandwiches": {"description": "The number of heavy grilled cheese sandwiches produced", "type": "continuous", "shape": []}}, "constraints": [{"description": "The total number of bread slices used for Light and Heavy sandwiches does not exceed TotalBread.", "formulation": "BreadPerLight \\cdot LightSandwiches + BreadPerHeavy \\cdot HeavySandwiches \\leq TotalBread", "code": {"gurobipy": "model.addConstr(BreadPerLight * LightSandwiches + BreadPerHeavy * HeavySandwiches <= TotalBread)"}}, {"description": "The total number of cheese slices used for Light and Heavy sandwiches does not exceed TotalCheese.", "formulation": "CheesePerLight \\times LightSandwiches + CheesePerHeavy \\times HeavySandwiches \\leq TotalCheese", "code": {"gurobipy": "model.addConstr(CheesePerLight * LightSandwiches + CheesePerHeavy * HeavySandwiches <= TotalCheese)"}}, {"description": "The number of Heavy grilled cheese sandwiches is at least MinHeavyToLightRatio times the number of Light grilled cheese sandwiches.", "formulation": "HeavySandwiches \\ge MinHeavyToLightRatio \\times LightSandwiches", "code": {"gurobipy": "model.addConstr(HeavySandwiches >= MinHeavyToLightRatio * LightSandwiches)"}}], "objective": {"description": "Total production time is the sum of the production times for Light and Heavy grilled cheese sandwiches. The objective is to minimize the total production time.", "formulation": "Min \\ TimePerLight \\times LightSandwiches + TimePerHeavy \\times HeavySandwiches", "code": {"gurobipy": "model.setObjective(TimePerLight * LightSandwiches + TimePerHeavy * HeavySandwiches, GRB.MINIMIZE)"}}}